#include <iostream>
#include <cmath>

int main () 
{
    double G = 6.673e-11;
    double m1, m2, r; 
    char continueInput;
    
    do 
    {

        /*-----------Отримуємо масу першого тіла m1-----------*/

        std::cout << "Введіть масу першого тіла (кг): "; 
        if (!(std::cin >> m1)) 
        {
            std::cout << "Введено некоректні дані. Програма завершує роботу." << std::endl; // Повертаємо код помилки
            break; 
        }
 
        /*-----------Отримуємо масу другого тіла m2-----------*/

        std::cout << "Введіть масу другого тіла (кг): "; 
        if (!(std::cin >> m2)) 
        {
            std::cout << "Введено некоректні дані. Програма завершує роботу." << std::endl; // Повертаємо код помилки
            break; 
        }

        /*-----------Отримуємо відстань між тілами r-----------*/

        std::cout << "Введіть відстань між тілами (м): "; 
        if (!(std::cin >> r)) 
        {
            std::cout << "Введено некоректні дані. Програма завершує роботу." << std::endl; // Повертаємо код помилки
            break; 
        }

        if (m1 <= 0 || m2 <= 0 || r <= 0) // Якщо m1, m2 та r <= 0, тоді, запускаємо програму знову 
        {
            std::cout << "Маси і відстань повинні бути більше нуля." 
                      << "\n" << "Спробуйте ще раз" 
                      << std::endl;
        }
        else 
        {
            double F = (G * m1 * m2) / (r * r); // Обчислюємо силу тяжіння за формулою Ньютона
            std::cout << "Сила тяжіння між тілами: " 
                      << F << " Нютонів (N)" 
                      << std::endl; // Виводимо результат

            do 
            {
                std::cout << "Бажаєте ввести нові дані? (Y/N): ";
                std::cin >> continueInput;

            } while (continueInput != 'Y' && continueInput != 'y' && continueInput != 'N' && continueInput != 'n');

            if (continueInput != 'Y' && continueInput != 'y')
            {
                break;
            }
        }
        
    } while (true);
    
    return 0; 
}