#include <iostream>
#include <cmath>

int main() {

    /*---------Визначення параметрів таблиці---------*/ 

    const double A = M_PI / 4;                            // 1. Визначаємо початкову межу відрізка.
    const double B = M_PI / 2;                            // 2. Визначаємо кінцеву межу відрізка.
    const int M = 15;                                     // 3. Число розбиття
    const double H = (B - A) / M;                         // 4. Обчислення кроку розбиття.

    /*----------------------------------------------*/ 

    std::cout << "\033[35m";  

    std::cout << "_____________________________________" << std::endl;
    std::cout << "|    функція:   |     відрізок:     |" << "\n";
    std::cout << "| f(x) = sin(x) |   [п / 4, п / 2]  |" << "\n";
    std::cout << "|_______________|___________________|" << "\n";
    std::cout << "|       X       |       f(x)        |" << "\n";
    std::cout << "|_______________|___________________|" << std::endl;

    for (int i = 0; i < M; i += 1) {
        double x = A + i * H; // Обчислення значення x.
        double fx = sin(x); // Обчислення значення функції f(x) (синус x).

        std::cout << "|   " << x << "    | " << fx << "          |" << std::endl;
    }

    std::cout << "\033[0m"; 

    return 0;
}